FILES/InformationRegisters/УсловияЗаполненияЗаказаКлиентаБТ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<InformationRegister>
		<Properties>
			<Name>УсловияЗаполненияЗаказаКлиентаБТ</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ШаблонНомераАкта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ШаблонНомераСчетФактуры</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ШаблонНомераСчета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Партнер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Партнеры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УсловияОтбора</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЭлементОтбора</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

FILES/InformationRegisters/АктуальныйДокументФормированияДокументов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<InformationRegister>
		<Properties>
			<Name>АктуальныйДокументФормированияДокументов</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Партнер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Партнеры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

FILES/Catalogs/ДоговорыКонтрагентов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<Catalog>
		<Properties>
			<Name>ДоговорыКонтрагентов</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Контрагенты</xr:Item>
			</Owners>
			<BasedOn>
				<xr:Item>Catalog.Партнеры</xr:Item>
			</BasedOn>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>БанковскийСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчетаОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БанковскийСчетКонтрагента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончанияДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВалютаВзаиморасчетов</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачалаДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Номер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>128</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Партнер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Партнеры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

FILES/InformationRegisters/УсловияЗаполненияЗаказаКлиентаБТ/Ext/ManagerModule.bsl
Функция ПолучитьАктуальныеНастройки(Партнер, Контрагент, Договор) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Партнер", Партнер);
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	Запрос.УстановитьПараметр("Договор", Договор);
	Запрос.УстановитьПараметр("КонтрагентПустой", Справочники.Контрагенты.ПустаяСсылка());
	Запрос.УстановитьПараметр("ДоговорПустой", Справочники.ДоговорыКонтрагентов.ПустаяСсылка());
	Запрос.Текст = "ВЫБРАТЬ
	               |	АктуальныйДокументФормированияДокументовСрезПоследних.Регистратор КАК Регистратор,
	               |	1 КАК Приоритет
	               |ПОМЕСТИТЬ АктуальныйДокумент
	               |ИЗ
	               |	РегистрСведений.АктуальныйДокументФормированияДокументов.СрезПоследних КАК АктуальныйДокументФормированияДокументовСрезПоследних
	               |ГДЕ
	               |	АктуальныйДокументФормированияДокументовСрезПоследних.Партнер = &Партнер
	               |	И АктуальныйДокументФормированияДокументовСрезПоследних.Контрагент = &Контрагент
	               |	И АктуальныйДокументФормированияДокументовСрезПоследних.Договор = &Договор
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	АктуальныйДокументФормированияДокументовСрезПервых.Регистратор,
	               |	2
	               |ИЗ
	               |	РегистрСведений.АктуальныйДокументФормированияДокументов.СрезПервых КАК АктуальныйДокументФормированияДокументовСрезПервых
	               |ГДЕ
	               |	АктуальныйДокументФормированияДокументовСрезПервых.Партнер = &Партнер
	               |	И АктуальныйДокументФормированияДокументовСрезПервых.Контрагент = &Контрагент
	               |	И АктуальныйДокументФормированияДокументовСрезПервых.Договор = &ДоговорПустой
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	АктуальныйДокументФормированияДокументовСрезПервых.Регистратор,
	               |	3
	               |ИЗ
	               |	РегистрСведений.АктуальныйДокументФормированияДокументов.СрезПервых КАК АктуальныйДокументФормированияДокументовСрезПервых
	               |ГДЕ
	               |	АктуальныйДокументФормированияДокументовСрезПервых.Партнер = &Партнер
	               |	И АктуальныйДокументФормированияДокументовСрезПервых.Контрагент = &КонтрагентПустой
	               |	И АктуальныйДокументФормированияДокументовСрезПервых.Договор = &ДоговорПустой
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	МИНИМУМ(АктуальныйДокумент.Приоритет) КАК Приоритет
	               |ПОМЕСТИТЬ МинимальныйПриоритет
	               |ИЗ
	               |	АктуальныйДокумент КАК АктуальныйДокумент
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	АктуальныйДокумент.Регистратор КАК Регистратор
	               |ПОМЕСТИТЬ АктуальныйДокумент2
	               |ИЗ
	               |	МинимальныйПриоритет КАК МинимальныйПриоритет
	               |		ЛЕВОЕ СОЕДИНЕНИЕ АктуальныйДокумент КАК АктуальныйДокумент
	               |		ПО МинимальныйПриоритет.Приоритет = АктуальныйДокумент.Приоритет
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	УсловияЗаполненияЗаказаКлиентаБТ.Партнер КАК Партнер,
	               |	УсловияЗаполненияЗаказаКлиентаБТ.Контрагент КАК Контрагент,
	               |	УсловияЗаполненияЗаказаКлиентаБТ.Договор КАК Договор,
	               |	УсловияЗаполненияЗаказаКлиентаБТ.УсловияОтбора КАК УсловияОтбора,
	               |	УсловияЗаполненияЗаказаКлиентаБТ.ШаблонНомераАкта КАК ШаблонНомераАкта,
	               |	УсловияЗаполненияЗаказаКлиентаБТ.ШаблонНомераСчетФактуры КАК ШаблонНомераСчетФактуры,
	               |	УсловияЗаполненияЗаказаКлиентаБТ.ШаблонНомераСчета КАК ШаблонНомераСчета,
	               |	УсловияЗаполненияЗаказаКлиентаБТ.Регистратор КАК Регистратор
	               |ИЗ
	               |	АктуальныйДокумент2 КАК АктуальныйДокумент
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УсловияЗаполненияЗаказаКлиентаБТ КАК УсловияЗаполненияЗаказаКлиентаБТ
	               |		ПО АктуальныйДокумент.Регистратор = УсловияЗаполненияЗаказаКлиентаБТ.Регистратор";
	Выгрузка = Запрос.Выполнить().Выгрузить();
	
	Возврат Выгрузка;
КонецФункции
